<?php

// _20102
// _2 服务级错误 （_1 系统级错误）
// 01 服务模块代码 00 通用模块（任意模块使用共通错误代码）
// 02 具体错误代码

// 系统级错误代码
$lang ['_10101'] = '系统错误';
$lang ['_10102'] = '服务暂停';
$lang ['_10103'] = '非法请求';
$lang ['_10104'] = '不能为空!';
$lang ['_10105'] = '签名认证失败!';
$lang ['_10106'] = '数据不存在!';
$lang ['_10107'] = '创建者creator不能为空!';
$lang ['_10108'] = '修改者editor不能为空!';
$lang ['_10109'] = '插入失败!';
$lang ['_10110'] = '修改失败!';
$lang ['_10111'] = '没有权限，请联系管理员!';
$lang ['_10112'] = 'user_token不能为空!';
$lang ['_10113'] = 'user_token错误!';
$lang ['_10114'] = 'user_token错误!';
$lang ['_10115'] = 'user_token错误!';
$lang ['_10116'] = '参数错误!';
$lang ['_10117'] = '文件损坏!';
$lang ['_10118'] = '文件大小不能超过10MB!';
$lang ['_10119'] = '文件类型错误,允许文件类型(png,jpg,jpeg,apk)!';
$lang ['_10120'] = '保存文件失败!';




$lang ['_20001'] = '账号(account)不能为空!';
$lang ['_20002'] = '密码(password)不能为空!';
$lang ['_20003'] = '账号不存在!';
$lang ['_20004'] = '密码错误!';
$lang ['_20005'] = '账号已关闭!';
$lang ['_20006'] = '账号已经存在!';
$lang ['_20007'] = '桌号已经存在!';

?>

